{"pageProps":{"technology":{"milestones":[{"technology":["recLFHVwomK6t7MOl"],"platforms":"Foundations of trust will be built into the automation platform, including verifiability, auditability, and transparency of automation. Automation and AI capabilities will be delivered on hyperscalers.","strategy":"In 2023, digital labor will be used in strategic business processes, with 100s of skills and completing 1000s of tasks a year. IT operation tools will be more advanced at incidence detection and triage, achieving 99.99% service level objectives.","innovations":"AI will enable digital employees to query, validate, and aggregate information, and improve workers’ collaborations. Human guidance combined with robotic skills and some fully automated skills will complete tasks. Predictive capabilities with AI will detect problems earlier. Better verifiability, auditability, and transparency will increase trust in automation.","milestone":"Digital labor automates strategic business processes and IT","year":"2023","significance":"Digital labor performing information-centric tasks augment people’s productivity. IT management will see improvements in service level objectives, mean time to identification and resolution of events, and cost.","start":"2023-01-01","end":"2024-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2023"},{"technology":["recLFHVwomK6t7MOl"],"platforms":"A real-time, trusted automation platform will be delivered with increasing accuracy, robustness, transparency, auditability, and usefulness.","strategy":"By 2024, business-critical tasks will be automated with governance, auditability, and trust. Digital employees with 1000s of skills completing 10,000s of tasks per year will be trained and managed with the regular workforce. ","innovations":"Advances in NLP will yield more complex natural language interactions with users to define outcomes and tasks. Process mining integrated with IT observability systems will provide an enterprise view of operations and impact analysis. AI and techniques to improve automation accuracy and rollback will help address more tasks and processes.","milestone":"Governance, auditability, and trust become integral","year":"2024","significance":"Trusted, real-time automation will lead to more tasks being automated, saving time for clients in more domains (insurance, banking, retail, etc.). IT systems will correlate lost revenue with outages and proactively prioritize remediation.","start":"2024-01-01","end":"2025-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2024"},{"technology":["recLFHVwomK6t7MOl"],"platforms":"Automation with mature trust and governance frameworks and performing more sophisticated interactions will be available to use with hyperscalers.","strategy":"2025 will see widespread use of trusted automation platform with built-in domain knowledge, accessible via multiple communication modalities. Business and IT operations will be integrated, offering proactive decisions.","innovations":"Foundation models over multi-modal IT and business data will provide broader prediction capabilities. Digital labor will be accessible via multiple channels (e.g., voice, text, video, mobile). Sophisticated automation skills will target more industry-specific processes. We will use quantifiable trust metrics to advance state-of-the-art automation.","milestone":"Business and IT automation converge to deliver efficiency and sustainability","year":"2025","significance":"With business and IT operations linked, enterprises can scale faster. AI-enhanced automation in the enterprise operations strategy will save cost and time, and thus raise productivity. Human intervention to remediate incidents will be less.","start":"2025-01-01","end":"2026-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2025"},{"technology":["recLFHVwomK6t7MOl"],"platforms":"TBD","strategy":"By 2027, automation will adapt to changing environments, provide more sophisticated predictions, proactively avoid incidents, improve service levels by 10x, and optimize across cost, performance, and carbon footprint","innovations":"Advances in AI-driven simulation and scenario planning will aid the automation of new processes in unknown situations. Trust, policy, and governance will be critical to manage automation and drive the acceptance of autonomous agents. Modeling of multiple modalities of observability data across business and IT will enable the proactive avoidance of incidents. ","milestone":"Automation adapts to changing environments for proactive operations","year":"2027","significance":"Enterprises will enjoy automation of ever more complex tasks and reassign how work gets done. Digital labor will disrupt more industries. Business processes and IT will be jointly optimized with real-time decision making.","start":"2027-01-01","end":"2028-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2027"},{"technology":["recLFHVwomK6t7MOl"],"platforms":"TBD","strategy":"2029 will bring trusted automated systems that will perform most of the mundane digital work. Business and IT will cease to be separate disciplines and become synergistic in definition and operation. ","innovations":"Digital twins will enable simulations of complex processes and applications spanning across clouds. Large foundation models will be broadly used across multiple business and IT domains. NLP interfaces of various modalities (voice, text, video) will facilitate human-system interactions. Trustworthy automation techniques will capture predictive behavior.","milestone":"Business and IT merge to automate most of the mundane tasks","year":"2029","significance":"With trusted automation augmented with AI performing more complex cognitive tasks, IT and business operations job roles will transform. Automation in new processes will increase business and IT efficiency, hence enterprise competitiveness. ","start":"2029-01-01","end":"2030-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2029"},{"technology":["recLFHVwomK6t7MOl"],"platforms":"Integrated decision-automation systems with AI will be integrated across hybrid clouds for the management of business processes and IT. ","strategy":"In 2030 and beyond, trusted decision-automation systems will operate most of the basic functions in an organization, with creative and strategic tasks done by humans. Automation will enforce the governance of sustainability goals.","innovations":"Advances in multi-agent reinforcement learning and stochastic game theory will help enable more complex autonomous processes, agents, and decision-automation systems with decentralized management tools. To respond to incidents, trustworthy automation will initiate predictive remediation and self-heal with zero downtime.","milestone":"Trusted decision automation brings the autonomous enterprise","year":"2030","significance":"Furnished with robust and adaptable automation, enterprises will become autonomous for business and IT processes, requiring minimal human management.","start":"2030-01-01","end":"2031-01-01","collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Automation – 2030"}],"collaborators":[{"id":"usrIJlKJ4JYgx6pbP","email":"Kelly.McGowan@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"description":"Digital labor is deployed at scale as task automation and orchestration enables trusted systems to perform core enterprise functions, merging IT and business processes.","name":"Automation","slug":"automation"},"year":"2029"},"__N_SSG":true}