{"pageProps":{"technology":{"milestones":[{"technology":["recG3rJmcsEdhGJf3"],"platforms":"Our 1,121-qubit Condor processor will debut, and multiple 133-qubits processors supporting faster, higher fidelity gates will be parallelized to extend the scale of computations. ","strategy":"2023 is all about pushing parallelization of Qiskit Runtime and elastic computing. This will enhance the speed and scale of quantum programs. ","innovations":"Threaded runtimes will automatically distribute tasks among multiple processors and use classical computation to parallelize. Integration with serverless tools will enable the first prototype of quantum serverless.","milestone":"Parallelization boosts the execution of quantum programs","year":"2023","significance":"Qiskit Runtime will allow kernel developers to build efficient primitive programs, such as sampler and estimator, thus leveraging multiple processors and error suppression techniques.","start":"2023-01-01","end":"2024-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2023"},{"technology":["recG3rJmcsEdhGJf3"],"platforms":"Qiskit Runtime service and exploratory devices will be available that scale the processor with modularity and a quantum communication network.","strategy":"In 2024, the accuracy of Qiskit Runtime will increase with error mitigation scaling to circuits of at least 100 qubits and depth 100. This will allow developers to derive better results from the output of quantum circuits.","innovations":"Built-in error mitigation will automatically determine the best method to reduce the effect of noise. A prototype intelligent orchestration framework will allow to develop a compiler for classical and quantum workflows.","milestone":"Scalable error mitigation  brings unrivaled accuracy","year":"2024","significance":"Qiskit Runtime with error mitigation will provide the foundation platform where algorithm and application developers can operate without worrying about the noise.","start":"2024-01-01","end":"2025-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2024"},{"technology":["recG3rJmcsEdhGJf3"],"platforms":"Pre-built Qiskit runtimes and optimized libraries ​will be available. A 4000+ quantum system will be demonstrated, made from multiple processors, with each processor made from multiple chips.","strategy":"2025 will be a year of scaling quantum applications with the incorporation of a circuit knitting toolbox and circuit libraries controlling Qiskit Runtime. This will strengthen quantum computing as a tool for science and business. ","innovations":"Libraries and tools will be established to enable the use of circuit knitting, including circuit cutting, embedding, and entanglement forging.","milestone":"Powerful tools and libraries scale quantum applications","year":"2025","significance":"Qiskit Runtime will provide libraries and tools for faster algorithm development.","start":"2025-01-01","end":"2026-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2025"},{"technology":["recG3rJmcsEdhGJf3"],"platforms":"Infrastructure will scale to 10’s of thousands of qubits toward quantum-centric supercomputers accessible with quantum serverless via the Qiskit Runtime interface. The platform will be able to delegate part of the runtime execution in real time.","strategy":"By 2027, we will speed up workflows with intelligent orchestration between classical resources and Qiskit Runtime. This will reduce friction with developers and allow greater integration of quantum computing into workflows. ","innovations":"An intelligent orchestration compiler and extended tools will provide efficient use of both quantum and classical processors.","milestone":"Intelligent orchestration speeds up workflows","year":"2027","significance":"Intelligent orchestration will increase the size of problems addressable by quantum computers and analyze workflows to identify the optimal hardware for the task. ","start":"2027-01-01","end":"2028-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2027"},{"technology":["recG3rJmcsEdhGJf3"],"platforms":"Qubit connectivity will extend beyond nearest neighbors, and processors will have 100s of thousands of qubits coupled with classical and quantum networks. The low-level stack will have dedicated primitive hardware.","strategy":"In 2029, we will integrate full error correction into Qiskit Runtime. This will dramatically increase the accuracy and speed of quantum workflows to bring quantum computing more fully into the mainstream. ","innovations":"Novel and efficient low density parity codes will be able to fix more errors using fewer quantum resources. Qiskit Runtime will orchestrate both error correction and error mitigation to provide noise-free outputs to the users.","milestone":"Full error correction comes online and changes everything","year":"2029","significance":"With error corrected quantum runtimes, users will be able to run large scale problems with business and science importance. ","start":"2029-01-01","end":"2030-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2029"},{"technology":["recG3rJmcsEdhGJf3"],"platforms":"A system will have millions of qubits in fridges linked by quantum interconnects, resembling the intranet links in supercomputing processors. Qiskit Runtime will integrate these clusters into ever more powerful quantum-centric supercomputers. ","strategy":"Beyond 2030, Qiskit Runtime will have greatly expanded capabilities and scale with fully-entangled networked quantum computer clusters. These quantum centric computation centers will tackle the next generation of problems. ","innovations":"Quantum interconnects will link QPUs in separate dilution refrigerators to provide distributed entanglement over long distances. Qiskit Runtime will include distributed software tools to manage entanglement over a network of quantum systems.","milestone":"The holy grail: fully-entangled networked quantum computer clusters","year":"2030","significance":"Qiskit Runtime will make quantum advantage accessible for very large-scale inherently serial problems. ","start":"2030-01-01","end":"2031-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Quantum – 2030"}],"collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"description":"A new quantum runtime integrates classical and quantum information, leveraging fully-entangled networks of quantum computers to deliver exponential advantages.","name":"Quantum","slug":"quantum"},"year":"2025"},"__N_SSG":true}