{"pageProps":{"technology":{"milestones":[{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"The multi-cloud platform deployed will include Linux, containers, Kubernetes, serverless development, scalable observability, and security. It will support multi-cloud, multi-modal programming models and development environments (e.g., Quarkus, Ray, Qiskit) ","strategy":"In 2023, enterprises will use common platforms to build, deploy, and manage workloads in multiple clouds. Managing these workloads will require the assembly of tools from multiple vendors.","innovations":"Linux and Kubernetes coupled with low-code, no-code, and serverless technologies will enable flexible deployment. Infrastructure-as-Code, as-a-service infrastructure, software services, and programmable domain-specific control planes will automate deployment. Verifiable deployment patterns with secure software supply chains will ensure trusted environments anywhere.","milestone":"A multi-cloud computing platform emerges","year":"2023","significance":"A consistent multi-cloud platform will provide increasing levels of automation. Together with core services across all deployment locations, this will give enterprises agility and efficiency at scale as they continue to adopt multiple clouds.","start":"2023-01-01","end":"2024-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2023"},{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"Delivery in 2023 will focus on edge and datacenter infrastructure-as-a-service in a low-code and no-code development environment with industry APIs integrated (e.g. BIAN).","strategy":"By 2024, we will see the use of AI for development, deployment, and operations greatly expanded. Declarative policy specifications will increase the scope of lifecycle automation.","innovations":"Scalable multi-cloud discovery and multi-cluster control planes will optimize workload placement. Data and integration fabrics will enable application composition across multiple clouds. Higher levels of abstractions, AIOps, and security capabilities such as attestation will enable secure operating environments.","milestone":"AI optimizes development and management of applications","year":"2024","significance":"Developers will experience great agility while benefiting from multi-cloud computing with high operational efficiency, low risk, and workload placement optimized for cost, performance, security, and compliance. ","start":"2024-01-01","end":"2025-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2024"},{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"A multi-cloud service mesh and integration fabric will be released. Multi-cloud computing will have scalable optimization, orchestration, and automation.","strategy":"2025 brings enterprises the ability to dynamically select and compose services across clouds to meet business, technical, and societal goals. ","innovations":"Infrastructure composition and industry models and APIs for application composition will optimize and connect operating environments. Sovereignty, sustainability, and compliance policies will enable dynamic placement and governance. The ability to operate autonomously in disconnected mode will fulfill regulatory and sovereignty requirements.","milestone":"Best-of-breed services are consumed across clouds","year":"2025","significance":"Dynamically composing services and infrastructure across multiple clouds allow developers to optimize applications to multiple objectives—sustainability, regulatory compliance, cost,  performance, etc.","start":"2025-01-01","end":"2026-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2025"},{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"The composable full multi-cloud stack will be advanced with programmable infrastructure, software, and services. It will be  furnished with observability and security. Access to quantum computing will be seamlessly integrated into the multi-cloud environment.","strategy":"By 2027, most enterprise applications will be composed and deployed dynamically.","innovations":"Pervasive standard platforms will abstract all aspects of infrastructure, middleware, and services. Scalable advances in AI, automation, and programming models will dynamically discover, deploy, and compose infrastructure and services. Built-in resiliency, AIOps, and threat management will allow ‘managing exceptions’ vs. continuous observability. ","milestone":"Applications are dynamically composed. Quantum computing enters the multi-cloud","year":"2027","significance":"Decoupling business applications from computing locations, services, and providers lets enterprises speed up the creation of new products. Advances in AI, quantum computing, and automation will dramatically accelerate the rate of innovation.  ","start":"2027-01-01","end":"2028-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2027"},{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"Open-source cloud OSS/BSS platforms will be broadly available.","strategy":"2029 bring the emergence of consistent business and operational standards that simplify peering and federation and enable enterprises to consume services freely across vendors.","innovations":"Standards for multi-cloud Operations Support System (OSS) and Business Support System (BSS) will be adopted broadly and enable multi-cloud marketplaces. Multi-cloud control planes will incorporate high performance exchanges between cloud providers.","milestone":"Standards bring computing services without boundaries","year":"2029","significance":"Technical and business standards will enable enterprise to seamlessly broker access across cloud providers, taking advantage of specific providers’ capabilities—cost, technology, sustainability, geography, industry specialization. ","start":"2029-01-01","end":"2030-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2029"},{"technology":["rec1ZPskLIaTSfIxd"],"platforms":"These innovations will be delivered in multi-cloud marketplaces and exchanges. The multi-cloud world will be hyper-scalable, with decentralized orchestration and automation.","strategy":"By 2030 and beyond, computing will be delivered as a utility, with multiple computing models—classical and quantum—and providers seamlessly integrated and meeting regulatory, security, and sovereignty constraints.     ","innovations":"Sovereignty and regulatory requirements are built-in from day zero and adapt easily to changes of provider or regulations. Advanced demand management, load-balancing, resiliency, security, routing, etc. are enabled across the entire multi-cloud control plane. ","milestone":"Multi-cloud computing dominates IT","year":"2030","significance":"Specialized computing (e.g., quantum computing, specialized hardware) will bring unprecedented ability to solve increasingly more challenging problems. The multi-cloud as a global utility will deliver it with simplicity.","start":"2030-01-01","end":"2031-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Hybrid Cloud – 2030"}],"collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"description":"Composable applications, services, and infrastructure enable enterprises to create a virtual dynamic and trusted computing environment across multiple clouds, with simplicity for development and operations.","name":"Hybrid Cloud","slug":"hybrid-cloud"},"year":"2025"},"__N_SSG":true}