{"pageProps":{"technology":{"milestones":[{"technology":["recOacAjrk9w05lPQ"],"platforms":"Security advances will be delivered in a cloud-native, open XDR platform differentiated with AI and simple to use. It will be integrated with infrastructure, the multi-cloud platform, applications, and data.","strategy":"In 2023, protection of high-value assets will tighten with extended threat detection and response in the hybrid cloud, and compliance with regulations. This will raise the mean time to failure and lower the mean time to recovery to within an hour.","innovations":"Standardized industry controls together with the development of an advanced assessment platform and compliance management tools will protect the attack surface. A cloud native and enterprise-grade log management solution, behavior analytics, and foundation models will be used to monitor the attack surface. Automation built with AI will enhance the open XDR capabilities.","milestone":"High-value assets are protected with extended detection and response (XDR)","year":"2023","significance":"With an evolving security threat landscape, XDR and compliance will help businesses move from point products to unified threat management to protect from growing threats and respond faster across hybrid cloud environments.","start":"2023-01-01","end":"2024-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2023"},{"technology":["recOacAjrk9w05lPQ"],"platforms":"Zero trust guarantees and continuous compliance will be built into the hybrid cloud stack at all levels and integrated with deployments across sovereign and hybrid clouds.","strategy":"By 2024, full-stack zero trust architectures that provide continuous compliance and digital sovereignty will make organizations more resilient. This will raise the mean time to failure and lower the mean time to recovery to minutes.","innovations":"Prescriptive zero trust-based controls with continuous industry monitoring and confidential containers built on secure enclaves for adaptive policy management with distributed enforcement will provide protection. AI foundation models on multiple telemetry sources will automate the threat management lifecycle. We will develop the risk operations center.","milestone":"Zero-trust controls and compliance yield resiliency and digital sovereignty","year":"2024","significance":"As digital transformations expand the attack surface, advances in 2024 will help organizations ensure risk-based access across multi-cloud environments to protect from cyber threats, and automated and continuous compliance.","start":"2024-01-01","end":"2025-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2024"},{"technology":["recOacAjrk9w05lPQ"],"platforms":"Security innovations, including software supply chain security for infrastructure and non-infrastructure and a software bill of materials, will be delivered in cloud-native services to meet SLSA level 4 for containers.","strategy":"In 2025, we will push high levels of protection to multi-cloud deployments with a secure software supply chain that, working with third party services, addresses open-source software vulnerabilities.","innovations":"A software bill of materials based on industry certifications like supply-chain levels for software artifacts (SLSA) will be generated. Monitoring will be enabled by software genome technologies that capture semantic representations of code using AI-based program analysis and knowledge graphs for analysis of software composition across legacy and closed-source code.","milestone":"A secure software supply chain brings a safer open multi-cloud world","year":"2025","significance":"A secure software supply chain protects enterprises by removing vulnerabilities arising from the increasing reliance on open-source software that may not pass provenance and security checks and lack common tools and standards.","start":"2025-01-01","end":"2026-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2025"},{"technology":["recOacAjrk9w05lPQ"],"platforms":"Crypto libraries with hardware acceleration and AI robustness toolkits will be delivered through open industry forums.","strategy":"By 2027, quantum-safe cryptography, fully homomorphic encryption (FHE), and robust AI will be widely deployed, becoming the norm in security to protect enterprises against advanced cyber attacks.","innovations":"A crypto-agility lifecycle will enable the migration to quantum-safe cryptography. Fully homomorphic encryption and AI robustness toolkits will produce privacy-enabled and robust AI. Model security operations (ModelSecOps) will discover and remediate vulnerable services and clear text data. ","milestone":"Quantum-safe cryptography and fully homomorphic encryption become the norm","year":"2027","significance":"Quantum-safe cryptography secures from attacks on classical cryptography using quantum algorithms. FHE protects against adversarial AI attacks on services while data is unencrypted to be computed on.","start":"2027-01-01","end":"2028-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2027"},{"technology":["recOacAjrk9w05lPQ"],"platforms":"Sovereign hybrid cloud and other distributed deployments will have decentralized identity and compliance, ensuring and managing trust everywhere.","strategy":"2029 will bring security and management of trust across decentralized computing/digital environments with self-sovereign identity and digital assets. This will bring protection and trust to sovereign clouds, virtual worlds, etc.","innovations":"Open standards and privacy-preserving techniques will secure decentralized environments like sovereign clouds, digital assets, decentralized identity, etc. Breach and attack simulations with a risk-driven approach will help address threats proactively and prevent breaches. A mature risk operation center will improve monitoring.","milestone":"Security brings trust to a new decentralized digital world","year":"2029","significance":"The innovations we will deliver in 2029 will enable organizations to solve the security challenges posed by the expanded attack surface of decentralized IT deployments like sovereign clouds and virtual worlds like the metaverse.","start":"2029-01-01","end":"2030-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2029"},{"technology":["recOacAjrk9w05lPQ"],"platforms":"The multi-cloud platform will be available with trusted hardware designed by secure, cloud-native processes and embedded in chips in trusted foundries.","strategy":"By 2030, we will reach a new state of security risk management with security controls incorporated along the full computing stack, from the lowest level up, and across multi-cloud applications and systems.","innovations":"A multi-cloud security control plane anchored in hardware security mechanisms such as chiplet security and secure, cloud-native electronic design automation (EDA) will be developed to track and counter adversaries. It will be used to protect and monitor the attack surfaces across applications and data.","milestone":"Security controls are everywhere","year":"2030","significance":"Security controls for the lower levels of the stack and across multi-cloud deployments counter adversaries trying to attack the very technologies driving the shift to the multi-cloud.","start":"2030-01-01","end":"2031-01-01","collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Security – 2030"}],"collaborators":[{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"description":"Extended Detection and Response (XDR) protects the full multi-cloud stack. Quantum-safe cryptography and fully-homomorphic encryption protect data and insights. Security and trust extend across decentralized environments, including the metaverse.","name":"Security","slug":"security"},"year":"2023"},"__N_SSG":true}