{"pageProps":{"technology":{"milestones":[{"technology":["rec9BXuWStkH4ebcE"],"platforms":"Data marketplaces will bring data products to consumers. There will be a unified, virtualized online analytic processing “front door” with graph capabilities.","strategy":"In 2023, the number of discoverable, trusted data products will increase 10-100x via a hybrid data fabric. These are high-quality, centrally-governed enterprise datasets that are ready for consumption and managed to enterprise standards.","innovations":"Advances in AI will power semantic augmentation, management, and governance. On-demand, policy-driven data replication and caching will address sovereignty, compliance, and performance. As-a-service tools will enable bidirectional information exchange between mainframes and cloud with security and governance assurances.","milestone":"Data products increase by orders of magnitude","year":"2023","significance":"The data product paradigm will set enterprise standards for data quality, governance, semantics, and observability. AI will scale data production and management of workflows.","start":"2023-01-01","end":"2024-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2023"},{"technology":["rec9BXuWStkH4ebcE"],"platforms":"Data stores with strong caching and tiering will take advantage of cheaper object storage. Open data and table formats will be pervasive.","strategy":"In 2024, AI will be used in data consumption and management, leading to a 10x increase in users of data products and enterprise productivity.","innovations":"AI-based agents will help users to easily find and create high-quality data views and custom pipelines. Policy-driven proactive replication, caching, and access capabilities will address multi-cloud latency and throughput. Extensible monitoring and observability will drive data mobility and management decisions.","milestone":"AI makes data consumption and management smarter","year":"2024","significance":"Self-service data consumption will increase return on investment. Less reliance on expert data skills will lead to more and more diverse data consumers. Secure, cost-efficient data operations will reduce silos and raise productivity.","start":"2024-01-01","end":"2025-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2024"},{"technology":["rec9BXuWStkH4ebcE"],"platforms":"z/OS data on the cloud will have enhanced security with fully homomorphic encryption, multi-party computation, etc.","strategy":"By 2025, secure, multi-cloud, data-centric workloads will be ubiquitous. A digitized workforce with data-centric skills will raise the operational productivity of businesses by orders of magnitude.","innovations":"The data-centric skills for AI-based agents will be expanded to data composition, predictive modeling, and decision making. AI will be used to optimize where and how data is stored, moved, and transformed. Automated composition of the data stack and query components will make custom-fit solutions possible.","milestone":"Multi-cloud, data-centric workloads become ubiquitous","year":"2025","significance":"Enterprises will be able to prepare and access data products simply and securely, independent of location. The digitized workforce capabilities will expand to discovery, preparation, and consumption of data products.","start":"2025-01-01","end":"2026-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2025"},{"technology":["rec9BXuWStkH4ebcE"],"platforms":"New classes of enterprise repositories will be deployed with first-class, ultra high dimensional representations for AI.","strategy":"By 2027, all forms of data consumption will be democratized, from basic reporting to predictive insights, sophisticated analytics, and decision making. Employees regularly driving actions with data will triple, boosting productivity.","innovations":"AI trained on natural language, code, and tabular data will be used to curate enterprise data and glossaries. We will develop the capability to do zero-shot generalization of AI to novel enterprise data and tasks with end user prompts. Natural language interactions and intelligent visualizations will be scaled to large dynamic data sets.","milestone":"Democratized data consumption bolsters business productivity","year":"2027","significance":"True data-driven enterprises will empower employees in every role, function, and skill level to leverage data and its insights to drive efficiencies, increase competitiveness, and gain advantages.","start":"2027-01-01","end":"2028-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2027"},{"technology":["rec9BXuWStkH4ebcE"],"platforms":"Data stores and processing engines, scaled with CXL, will offer major cost and performance wins. There will be more focus on secure, software-defined networking.","strategy":"2029 will see composable hardware going mainstream. This will transform networks, drive a 3x cost reduction due to disaggregated hardware, and push egress costs down.","innovations":"Compute Express Link (CXL), with its ability to disaggregate memory from processor, will be used to deliver faster memory and compute. New types of accelerators like data processing cores will be commonly used. Cheap, fast networking will bring the next wave of data into most enterprises. Competitive pressure will sink cloud egress fees. ","milestone":"Composable hardware goes mainstream, egress costs plummet","year":"2029","significance":"Major hardware trends will disrupt data stores and processing engines. Lower egress fees will remove vendor lock-in and change the cost dynamics of multi-cloud computing.","start":"2029-01-01","end":"2030-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2029"},{"technology":["rec9BXuWStkH4ebcE"],"platforms":"Computing platforms will be furnished with mechanisms for distributed data identity and full permissioned network connectivity.","strategy":"By 2030 and beyond, the amount of permissioned data products available to anyone in an enterprise will grow by orders of magnitude, instantly found and accessed regardless of location—on devices, edge, data center, SaaS, etc.","innovations":"A universal, location-independent method to find and identify data will be realized. We will produce and use semantically rich metadata that is interoperable and federated across any set of organizations and repositories. Security mechanisms will be developed to ensure permissioned data access in this widely distributed, decentralized setting.","milestone":"Instant permissioned data easily accessed anywhere","year":"2030","significance":"Enterprises will have a true 360º view of all data assets and the ability to leverage all the information to radically improve business insights and actions.","start":"2030-01-01","end":"2031-01-01","collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"name":"Data – 2030"}],"collaborators":[{"id":"usr5rv3Psv8c16Jsn","email":"emma.sainz@ibm.com"},{"id":"usri9u0883HQXAb2X","email":"Vincent.Patrick.Picone@ibm.com","name":"Vince Picone"}],"description":"Data treated as a product—with its associated metadata, code, and infrastructure—and integrated into a hybrid data fabric, provides high-quality, centrally-governed, distributed data feeds to multi-cloud-native workflows. ","name":"Data","slug":"data"},"year":"2027"},"__N_SSG":true}